BEGIN { _prep() }
{ print _zen2han($0) }

function _prep(    z) {
  z["　"]=" ";  z["！"]="!";  z["\342\200\234"]="\""; z["＃"]="#";
  z["＄"]="$";  z["％"]="%";  z["＆"]="&";  z["\342\200\230"]="'";
  z["（"]="(";  z["）"]=")";  z["＊"]="*";  z["＋"]="+";
  z["，"]=",";  z["－"]="-";  z["．"]=".";  z["／"]="/";
  z["０"]="0";  z["１"]="1";  z["２"]="2";  z["３"]="3";
  z["４"]="4";  z["５"]="5";  z["６"]="6";  z["７"]="7";
  z["８"]="8";  z["９"]="9";  z["："]=":";  z["；"]=";";
  z["＜"]="<";  z["＝"]="=";  z["＞"]=">";  z["？"]="?";
  z["＠"]="@";  z["Ａ"]="A";  z["Ｂ"]="B";  z["Ｃ"]="C";
  z["Ｄ"]="D";  z["Ｅ"]="E";  z["Ｆ"]="F";  z["Ｇ"]="G";
  z["Ｈ"]="H";  z["Ｉ"]="I";  z["Ｊ"]="J";  z["Ｋ"]="K";
  z["Ｌ"]="L";  z["Ｍ"]="M";  z["Ｎ"]="N";  z["Ｏ"]="O";
  z["Ｐ"]="P";  z["Ｑ"]="Q";  z["Ｒ"]="R";  z["Ｓ"]="S";
  z["Ｔ"]="T";  z["Ｕ"]="U";  z["Ｖ"]="V";  z["Ｗ"]="W";
  z["Ｘ"]="X";  z["Ｙ"]="Y";  z["Ｚ"]="Z";  z["［"]="[";
  z["＼"]="\\"; z["］"]="]";  z["＾"]="^";  z["＿"]="_";
  z["\342\200\231"]="`"; z["ａ"]="a"; z["ｂ"]="b"; z["ｃ"]="c";
  z["ｄ"]="d";  z["ｅ"]="e";  z["ｆ"]="f";  z["ｇ"]="g";
  z["ｈ"]="h";  z["ｉ"]="i";  z["ｊ"]="j";  z["ｋ"]="k";
  z["ｌ"]="l";  z["ｍ"]="m";  z["ｎ"]="n";  z["ｏ"]="o";
  z["ｐ"]="p";  z["ｑ"]="q";  z["ｒ"]="r";  z["ｓ"]="s";
  z["ｔ"]="t";  z["ｕ"]="u";  z["ｖ"]="v";  z["ｗ"]="w";
  z["ｘ"]="x";  z["ｙ"]="y";  z["ｚ"]="z";  z["｛"]="{";
  z["｜"]="|";  z["｝"]="}";  z["～"]="~";
  z["。"]="｡";  z["「"]="｢";  z["」"]="｣";
  z["、"]="､";  z["・"]="･";  z["ヲ"]="ｦ";  z["ァ"]="ｧ";
  z["ィ"]="ｨ";  z["ゥ"]="ｩ";  z["ェ"]="ｪ";  z["ォ"]="ｫ";
  z["ャ"]="ｬ";  z["ュ"]="ｭ";  z["ョ"]="ｮ";  z["ッ"]="ｯ";
  z["ー"]="ｰ";  z["ア"]="ｱ";  z["イ"]="ｲ";  z["ウ"]="ｳ";
  z["エ"]="ｴ";  z["オ"]="ｵ";  z["カ"]="ｶ";  z["キ"]="ｷ";
  z["ク"]="ｸ";  z["ケ"]="ｹ";  z["コ"]="ｺ";  z["サ"]="ｻ";
  z["シ"]="ｼ";  z["ス"]="ｽ";  z["セ"]="ｾ";  z["ソ"]="ｿ";
  z["タ"]="ﾀ";  z["チ"]="ﾁ";  z["ツ"]="ﾂ";  z["テ"]="ﾃ";
  z["ト"]="ﾄ";  z["ナ"]="ﾅ";  z["ニ"]="ﾆ";  z["ヌ"]="ﾇ";
  z["ネ"]="ﾈ";  z["ノ"]="ﾉ";  z["ハ"]="ﾊ";  z["ヒ"]="ﾋ";
  z["フ"]="ﾌ";  z["ヘ"]="ﾍ";  z["ホ"]="ﾎ";  z["マ"]="ﾏ";
  z["ミ"]="ﾐ";  z["ム"]="ﾑ";  z["メ"]="ﾒ";  z["モ"]="ﾓ";
  z["ヤ"]="ﾔ";  z["ユ"]="ﾕ";  z["ヨ"]="ﾖ";  z["ラ"]="ﾗ";
  z["リ"]="ﾘ";  z["ル"]="ﾙ";  z["レ"]="ﾚ";  z["ロ"]="ﾛ";
  z["ワ"]="ﾜ";  z["ン"]="ﾝ";  z["゛"]="ﾞ";  z["゜"]="ﾟ";
  z["ガ"]="ｶﾞ"; z["ギ"]="ｷﾞ"; z["グ"]="ｸﾞ"; z["ゲ"]="ｹﾞ";
  z["ゴ"]="ｺﾞ"; z["ザ"]="ｻﾞ"; z["ジ"]="ｼﾞ"; z["ズ"]="ｽﾞ";
  z["ゼ"]="ｾﾞ"; z["ゾ"]="ｿﾞ"; z["ダ"]="ﾀﾞ"; z["ヂ"]="ﾁﾞ";
  z["ヅ"]="ﾂﾞ"; z["デ"]="ﾃﾞ"; z["ド"]="ﾄﾞ"; z["バ"]="ﾊﾞ";
  z["ビ"]="ﾋﾞ"; z["ブ"]="ﾌﾞ"; z["ベ"]="ﾍﾞ"; z["ボ"]="ﾎﾞ";
  z["パ"]="ﾊﾟ"; z["ピ"]="ﾋﾟ"; z["プ"]="ﾌﾟ"; z["ペ"]="ﾍﾟ";
  z["ポ"]="ﾎﾟ"; z["ヴ"]="ｳﾞ"; z["ヷ"]="ﾜﾞ"; z["ヺ"]="ｦﾞ";
  for (k in z) { _z2h[k] = z[k] }
  _cC0 = sprintf("\300"); _cE0 = sprintf("\340");
  _cF0 = sprintf("\360"); _cF8 = sprintf("\370");
  _cFC = sprintf("\374"); _cFE = sprintf("\376");
  _grp[sprintf("\342\200")] = 1;
  _grp[sprintf("\343\200")] = 1;
  _grp[sprintf("\343\202")] = 1;
  _grp[sprintf("\343\203")] = 1;
  _grp[sprintf("\357\274")] = 1;
  _grp[sprintf("\357\275")] = 1;
}

function _zen2han(s,    i,c,c1,c2,o) {
  o = ""
  for (i = 1; i <= length(s); i++) {
    c = substr(s, i, 1)
    if        (c < _cC0) { o = o c }
    else if   (c < _cE0) { i++; o = o c substr(s, i, 1) }
    else if   (c < _cF0) {
      c1 = substr(s, i+1, 1); c2 = substr(s, i+2, 1)
      if (((c c1) in _grp) && ((c c1 c2) in _z2h)) {
        o = o _z2h[c c1 c2]
      } else {
        o = o c c1 c2
      }
      i += 2
    } else if (c < _cF8) { o = o c substr(s, i+1, 3); i += 3 }
    else if   (c < _cFC) { o = o c substr(s, i+1, 4); i += 4 }
    else if   (c < _cFE) { o = o c substr(s, i+1, 5); i += 5 }
    else                 { o = o c }
  }
  return o
}
